4gn5t/psoc6-wav-speaker-player/source/main.c
#include "cyhal.h"
#include "cybsp.h"
#include "cy_pdl.h"

#include "audio_i2s.h"
#include "wav_parse.h"
#include "display.h"
#include "fatfs/diskio.h"
#include "fatfs/ff.h"
#include "fatfs/sd_card.h"
#include <stdio.h>

/*******************************************************************************
* Function Name: main
********************************************************************************
*
* Summary:
* The main function performs the following actions:
*  1. Initializes the device and board peripherals.
*  2. Initializes the file system.
*  3. Mounts the SD card.
*  4. Initializes the audio subsystem.
*  5. Starts playing audio files.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;

    /* Initialize the device and board peripherals */
    result = cybsp_init() ;
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    __enable_irq();

    /* Init the clocks */
    clock_init();

    /* Initialize the User LED */
    cyhal_gpio_init(CYBSP_USER_LED, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, CYBSP_LED_STATE_OFF);

    /* Initialize the User Button */
    cyhal_gpio_init(CYBSP_USER_BTN, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLUP, CYBSP_BTN_OFF);
    cyhal_gpio_enable_event(CYBSP_USER_BTN, CYHAL_GPIO_IRQ_FALL, CYHAL_ISR_PRIORITY_DEFAULT, true);
    cyhal_gpio_init(CYBSP_USER_BTN2, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLUP, CYBSP_BTN_OFF);
    cyhal_gpio_enable_event(CYBSP_USER_BTN2, CYHAL_GPIO_IRQ_FALL, CYHAL_ISR_PRIORITY_DEFAULT, true);

    /* Initialize the Master Clock with a PWM */
    cyhal_pwm_init(&mclk_pwm, MCLK_PIN, NULL);
    cyhal_pwm_set_duty_cycle(&mclk_pwm, MCLK_DUTY_CYCLE, MCLK_FREQ_HZ);
    cyhal_pwm_start(&mclk_pwm);

    /* Wait for the MCLK to clock the audio codec */
    cyhal_system_delay_ms(1);

    /* Initialize the I2S */
    cyhal_i2s_init(&i2s, &i2s_pins, NULL, &i2s_config, &audio_clock);
    
#ifdef USE_AK4954A
    if (!audio_i2c_init_and_codec()) {
        NVIC_SystemReset();
    }
#endif

    ui_init();

    static FATFS fs;
    bool sd_card_present_prev = false;

    for(;;)
    {
        FRESULT fres = f_mount(&fs, "", 1);
        bool sd_card_present = (fres == FR_OK);

        if (sd_card_present != sd_card_present_prev) {
            GUI_Clear();
            if (!sd_card_present) {
                GUI_DispStringAt("Failed SD card", 100, 0);
            } else {
                scan_wav_files_sd_card();
                GUI_DispStringAt("SD card mounted", 100, 0);
                update_display();
            }
            sd_card_present_prev = sd_card_present;
        }

        cyhal_syspm_sleep();
        ui_process(); 
    }
}
